"""
python-ში შექმენით 20 ერორი, დღევანდელი მასწავლი მასალის გამოყენებით, შემდეგ კი გვერდზე კომენტარის სახით დაუწერეთ 
სწორი ფორმა და ახსენით რაიყო შეცდომა და როგორ გაასწორეთ,
ასევე დაუწერეთ ჩადური ახსნა კომენტარის სახით, გაარჩიეთ სათითაოდ ყველა ხაზი.
"""

mom = Lika M u k b aniani                 # mom = "lika Mukbaniani"
# დავადეკლარირეთ str ტიპის ცვლადი სახელად mum და მნიშვნელობად მივანიჭეთ Lika Mukbaniai. 
# თავდაპირველად ცვლადის მნიშვნელობა არ იყო მოქცეული ბრჭხალებში  და ასოებს შორის გვქონდა ზედმეტი space-ები.
# ამ შეცდომების გასასწორებლად ცვლადის მნიშვნელობა მოვაქციეთ ბრჭხალებში და მოვაშორეთ ზედმეტი space-ები.

dad = Gio E d i s h e r ashvili           # dad = "Gio Edisherashvili"  
# დავადეკლარირეთ str ტიპის ცვლადი სახელად dad და მნიშვნელობად მივანიჭეთ Gio Edisherashvili.
# თავდაპირველად ცვლადის მნიშვნელობა არ იყო მოქცეული ბრჭხალებში  და ასოებს შორის გვქონდა ზედმეტი space-ები. 
# ამ შეცდომების გასასწორებლად ცვლადის მნიშვნელობა მოვაქციეთ ბრჭხალებში და მოვაშორეთ ზედმეტი space-ები.

sister = Mari  E d i s h e  rashvili      # sister = "Mari Edisheსrashvili"
# დავადეკლარირეთ str ტიპის ცვლადი სახელად sister და მნიშვნელობად მივანიჭეთ Mari Edisherashvili.
# თავდაპირველად ცვლადის მნიშვნელობა არ იყო მოქცეული ბრჭხალებში  და ასოებს შორის გვქონდა ზედმეტი space-ები.
# ამ შეცდომების გასასწორებლად ცვლადის მნიშვნელობა მოვაქციეთ ბრჭხალებში და მოვაშორეთ ზედმეტი space-ები.