# შექმენით პროგრამა რომელშიც გექნებათ ხილის სია კალათა (list), შემდეგ მომხარებელს შემოატანინეთ თავისი 
# საყვარელი ხილი (input), for ციკლის საშვალებით შეამოწმეთ არის თუ არა ეს ხილი სიაში პირობითი განცხადების 
# აშვალებით (if-else),
#  თუ არის დაუბეჭდეთ "Good choice" თუ არ არის "Fruit not in basket"

fruit_list = ["ვაშლი", "ბანანი", "ფორთოხალი", "მანგო"]
user_input = input("აირჩიეთ საყვარელი ხილი: ")

if user_input in fruit_list:
    print("კარგი არჩევანია👍")
else:
    print("ხილი არ არის კალათაში")