# დღევანდელ ნასწავლ მასალაზე ივარჯიშეთ თქვენიც ძალიან ბევრი

numbers = [3, 7, 9, 1, 2, 12, 10, 56, 33, 22]

# 1) ჩამოჭერით და დაპრინთეთ სიის პირველი 5 ელემენტი.
print(numbers[0:5])

# 2) ჩამოჭერით და დაპრინტეთ სიის ბოლო 3 ელემენტი.
print(numbers[7:10])

# 3) ჩამოჭერით და დაპრინტეთ 2-დან 33-ის ჩათვლით ყველა ელემენტი უარყოფითი ინდექსების გამოყენებით.
print(numbers[-6: -1])

# 4) დაპრინტეთ მთელი სია შებრუნებულად.
print(numbers[9::-1])

# 5) დაპრინტეთ მთელი სიაშებრუნებულად უარყოფითი ინდექსების გამოყენებით.
print(numbers[-1:-11:-1])